
<div>        
    <img src="..\Week 01\img\R_logo.svg" width="100"/>  
</div>

<div style="line-height:600%;">
    <font color=#1363E1 face="Sriracha" size=8>
            <div align=center>R Data Structure</div>
    </font>    
</div>

<div>        
    <img src="..\Week 04\img\DataSt.png" width="600"/>  
</div>

<div style="line-height:600%;">
    <font color=#1363E1 face="Sriracha" size=8>
            <div align=center>Data Frames</div>
    </font>    
</div>

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    A <b>Data Frame</b> is a <mark>Table</mark> or a <mark>Two-dimensional Array-like Structure</mark> in which each column contains values of one variable and each row contains one set of values from each column.
                    
Following are the characteristics of a data frame:
<ul>
  <li>The column names should be non-empty.</li>
  <li>The row names should be unique</li>
  <li>The data stored in a data frame can be of numeric, factor or character type.</li>
    <li>Each column should contain same number of data items.</li>
</ul>
                </div>
    </font>
</div>

<div style="line-height:300%;">
    <font color=#9A0909 face="Sriracha" size=6>
                <div align=left>Create Data Frame</div>
    </font>
</div>

In [9]:
# Create the data frame.
data <- data.frame(emp_id = c(1, NA, 2, 3000 ,NA),
                   emp_name = c("Rick", "Dan", "Michelle", "Ryan", "Gary"),
                   salary = c(623.3, 515.2, 611.0, 729.0, 843.25),
                   start_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11", "2015-03-27")),
                   stringsAsFactors = FALSE)

# Print the data frame.
print(data)

  emp_id emp_name salary start_date
1      1     Rick 623.30 2012-01-01
2     NA      Dan 515.20 2013-09-23
3      2 Michelle 611.00 2014-11-15
4   3000     Ryan 729.00 2014-05-11
5     NA     Gary 843.25 2015-03-27

<div style="line-height:300%;">
    <font color=#9A0909 face="Sriracha" size=6>
                <div align=left>Get the Structure of the Data Frame</div>
    </font>
</div>

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    The structure of the data frame can be seen by using <mark>str() function</mark>:
                </div>
    </font>
</div>

<div style="line-height:200%;">
    <font color=#076F9A face="Candara" size=4>
                <div align=left>
                    <b>Example:</b>
                </div>
    </font>
</div>

In [6]:
# Get the structure of the data frame.
str(data)

'data.frame':	5 obs. of  4 variables:
 $ emp_id    : num  1 NA 2 3 NA
 $ emp_name  : chr  "Rick" "Dan" "Michelle" "Ryan" ...
 $ salary    : num  623 515 611 729 843
 $ start_date: Date, format: "2012-01-01" "2013-09-23" ...


<div style="line-height:300%;">
    <font color=#9A0909 face="Sriracha" size=6>
                <div align=left>Summary of Data in Data Frame</div>
    </font>
</div>

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    The statistical summary and nature of the data can be obtained by applying <mark>summary() function</mark>:
                </div>
    </font>
</div>

<div style="line-height:200%;">
    <font color=#076F9A face="Candara" size=4>
                <div align=left>
                    <b>Example:</b>
                </div>
    </font>
</div>

In [10]:
# Print the summary.
summary(data)

     emp_id         emp_name             salary        start_date
 Min.   :   1.0   Length:5           Min.   :515.2   Min.   :2012-01-01
 1st Qu.:   1.5   Class :character   1st Qu.:611.0   1st Qu.:2013-09-23
 Median :   2.0   Mode  :character   Median :623.3   Median :2014-05-11
 Mean   :1001.0                      Mean   :664.4   Mean   :2014-01-14
 3rd Qu.:1501.0                      3rd Qu.:729.0   3rd Qu.:2014-11-15
 Max.   :3000.0                      Max.   :843.2   Max.   :2015-03-27
 NA's   :2


<div style="line-height:300%;">
    <font color=#9A0909 face="Sriracha" size=6>
                <div align=left>Extract Data from Data Frame</div>
    </font>
</div>

We can use either [, [[ or $ operator to access columns of data frame.

Accessing with [[ or $ is similar. However, it differs for [ in that, indexing with [ will return us a data frame but the other two will reduce it into a vector.

<div style="line-height:200%;">
    <font color=#076F9A face="Candara" size=4>
                <div align=left>
                    <b>Example:</b>
                </div>
    </font>
</div>

In [12]:
# Extract Specific columns.
result1 <- data$emp_name

print(result1)

print(typeof(result1))

print(class(result1))

[1] "Rick"     "Dan"      "Michelle" "Ryan"     "Gary"
[1] "character"
[1] "character"

In [13]:
result2 <- data["emp_name"]

print(result2)

print(typeof(result2))

print(class(result2))

  emp_name
1     Rick
2      Dan
3 Michelle
4     Ryan
5     Gary
[1] "list"
[1] "data.frame"

In [14]:
result3 <- data[["emp_name"]]

print(result3)

print(typeof(result3))

print(class(result3))

[1] "Rick"     "Dan"      "Michelle" "Ryan"     "Gary"
[1] "character"
[1] "character"

In [15]:
result4 <- data[2]

print(result4)

print(typeof(result4))

print(class(result4))

  emp_name
1     Rick
2      Dan
3 Michelle
4     Ryan
5     Gary
[1] "list"
[1] "data.frame"

In [26]:
result4 <- data[[2]]

print(result4)

print(typeof(result4))

print(class(result4))

[1] "Rick"     "Dan"      "Michelle" "Ryan"     "Gary"
[1] "character"
[1] "character"

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    Extract the first two rows and then all columns:
                </div>
    </font>
</div>

In [16]:
# Extract first two rows.
result <- data[1:2,]

print(result)

typeof(result)

class(result)

  emp_id emp_name salary start_date
1      1     Rick  623.3 2012-01-01
2     NA      Dan  515.2 2013-09-23

[1] "list"

[1] "data.frame"

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    Extract 3rd and 5th row with 2nd and 4th column:
                </div>
    </font>
</div>

In [19]:
# Extract 3rd and 5th row with 2nd and 4th column.
result <- data[c(3,5),c(2,4)]

print(result)

  emp_name start_date
3 Michelle 2014-11-15
5     Gary 2015-03-27


<div style="line-height:300%;">
    <font color=#9A0909 face="Sriracha" size=6>
                <div align=left>Expand Data Frame</div>
    </font>
</div>

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    A data frame can be expanded by adding columns and rows:
                </div>
    </font>
</div>

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    <b>Add Column:</b> Just add the column vector using a new column name.
                </div>
    </font>
</div>

In [20]:
# Add the "dept" coulmn.
data$dept <- c("IT", "Operations", "IT", "HR", "Finance")

v <- data

print(v)

  emp_id emp_name salary start_date       dept
1      1     Rick 623.30 2012-01-01         IT
2      2      Dan 515.20 2013-09-23 Operations
3      3 Michelle 611.00 2014-11-15         IT
4      4     Ryan 729.00 2014-05-11         HR
5      5     Gary 843.25 2015-03-27    Finance

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    <b>Add Row:</b> To add more rows permanently to an existing data frame, we need to bring in the new rows in the same structure as the existing data frame and use the <mark>rbind() function</mark>.

In the example below we create a data frame with new rows and merge it with the existing data frame to create the final data frame.
                </div>
    </font>
</div>

In [22]:
# Create the data frame.
data <- data.frame(emp_id = 1:5,
                   emp_name = c("Rick", "Dan", "Michelle", "Ryan", "Gary"),
                   salary = c(623.3, 515.2, 611.0, 729.0, 843.25),
                   start_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11", "2015-03-27")),
                   dept = c("IT", "Operations", "IT", "HR", "Finance"),
                   stringsAsFactors = FALSE)


# Create the second data frame
dataNew <- data.frame(emp_id = 6:8,
                      emp_name = c("Rasmi", "Pranab", "Tusar"),
                      salary = c(578.0, 722.5, 632.8),
                      start_date = as.Date(c("2013-05-21","2013-07-30","2014-06-17")),
                      dept = c("IT","Operations","Fianance"),
                      stringsAsFactors = FALSE)


# Bind the two data frames.
finaldata <- rbind(data, dataNew)
print(finaldata)

  emp_id emp_name salary start_date       dept
1      1     Rick 623.30 2012-01-01         IT
2      2      Dan 515.20 2013-09-23 Operations
3      3 Michelle 611.00 2014-11-15         IT
4      4     Ryan 729.00 2014-05-11         HR
5      5     Gary 843.25 2015-03-27    Finance
6      6    Rasmi 578.00 2013-05-21         IT
7      7   Pranab 722.50 2013-07-30 Operations
8      8    Tusar 632.80 2014-06-17   Fianance

In [17]:
# Create the data frame.
data <- data.frame(emp_id = 1:5,
                   emp_name = c("Rick", "Dan", "Michelle", "Ryan", "Gary"),
                   salary = c(623.3, 515.2, 611.0, 729.0, 843.25),
                   start_date = as.Date(c("2012-01-01", "2013-09-23", "2014-11-15", "2014-05-11", "2015-03-27")),
                   dept = c("IT", "Operations", "IT", "HR", "Finance"),
                   stringsAsFactors = FALSE)


# Create the second data frame
dataNew <- data.frame(log = c(T, T, F, T, F))


# Bind the two data frames.
finaldata <- cbind(data, dataNew)
print(finaldata)

  emp_id emp_name salary start_date       dept   log
1      1     Rick 623.30 2012-01-01         IT  TRUE
2      2      Dan 515.20 2013-09-23 Operations  TRUE
3      3 Michelle 611.00 2014-11-15         IT FALSE
4      4     Ryan 729.00 2014-05-11         HR  TRUE
5      5     Gary 843.25 2015-03-27    Finance FALSE


<div style="line-height:300%;">
    <font color=#9A0909 face="Sriracha" size=6>
                <div align=left>Tips and Tricks</div>
    </font>
</div>

In [24]:
Id <- c(1:6)

Name <- c("John", "Rob", "Christy","Johnson", "Miller", "Zhu")

Occupation <- c("Professional", "Management", "Developer", "Programmer", "Clerical", "Admin")

Salary <- c(80000, 90000, 75000, 92000, 68000, 82000)

# We are assigning new names to the Columns
employee <- data.frame("Empid" = Id, "Full_Name" = Name, "Profession" = Occupation, "income" = Salary)

print(employee)

  Empid Full_Name   Profession income
1     1      John Professional  80000
2     2       Rob   Management  90000
3     3   Christy    Developer  75000
4     4   Johnson   Programmer  92000
5     5    Miller     Clerical  68000
6     6       Zhu        Admin  82000

In [25]:
# Names function will display the Index Names of each Item 
print(names(employee))

[1] "Empid"      "Full_Name"  "Profession" "income"

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    Accessing Low Level elements of R Data Frame:
                </div>
    </font>
</div>

In [49]:
Id <- c(1:6)
Name <- c("John", "Rob", "Christy","Johnson", "Miller", "Zhu")
Occupation <- c("Professional", "Management", "Developer", "Programmer", "Clerical", "Admin")
Salary <- c(80000, 90000, 75000, 92000, 68000, 82000)

employee <- data.frame(Id, Name, Occupation, Salary)

print(employee)

  Id    Name   Occupation Salary
1  1    John Professional  80000
2  2     Rob   Management  90000
3  3 Christy    Developer  75000
4  4 Johnson   Programmer  92000
5  5  Miller     Clerical  68000
6  6     Zhu        Admin  82000

In [46]:
# Accessing Element at 1st Row and 2nd Column 
A = employee[1:3, c("Name", "Salary")]
print(A)

class(A)
typeof(A)

     Name Salary
1    John  80000
2     Rob  90000
3 Christy  75000

[1] "data.frame"

[1] "list"

In [31]:
# Accessing Element at 4th Row and 3rd Column 
employee[4, 3]

[1] Programmer
Levels: Admin Clerical Developer Management Professional Programmer

In [32]:
# Accessing All Elements at 5th Row 
employee[5, ]

  Id Name   Occupation Salary
5 5  Miller Clerical   68000

In [33]:
    
# Accessing All Item of the 4th Column 
employee[, 4]

[1] 80000 90000 75000 92000 68000 82000

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    Accessing Multiple Values from R Data:
                </div>
    </font>
</div>

In [34]:
# Accessing Item at 1st, 2nd Rows and 3rd, 4th Columns 
employee[c(1, 2), c(3, 4)]

# Accessing Item at 2nd, 3rd, 4th Rows and 2nd, 4th Columns 
employee[2:4, c(2, 4)] 

# Accessing All Item at 2nd, 3rd, 4th, 5th Rows 
employee[2:5, ] 
         
# Accessing All Item of 2nd and 4th Column 
employee[c(2, 4)]

  Occupation   Salary
1 Professional 80000
2 Management   90000

  Name    Salary
2 Rob     90000
3 Christy 75000
4 Johnson 92000

  Id Name    Occupation Salary
2 2  Rob     Management 90000
3 3  Christy Developer  75000
4 4  Johnson Programmer 92000
5 5  Miller  Clerical   68000

  Name    Salary
1 John    80000
2 Rob     90000
3 Christy 75000
4 Johnson 92000
5 Miller  68000
6 Zhu     82000

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    Access R Data Frame Elements at Lower Level using $:
                </div>
    </font>
</div>

In [47]:
# Accessing Item at 2nd, 4th Rows of Name Columns 
employee$Name[c(2, 4)] 

# Accessing Item at 2nd, 3rd, 4th, 5th Rows of Occupation Column 
employee$Occupation[2:5]
employee[2:5, "Occupation"]

[1] Rob     Johnson
Levels: Christy John Johnson Miller Rob Zhu

[1] Management Developer  Programmer Clerical
Levels: Admin Clerical Developer Management Professional Programmer

[1] Management Developer  Programmer Clerical
Levels: Admin Clerical Developer Management Professional Programmer

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                    Modifying R Data Frame Elements:
                </div>
    </font>
</div>

In [50]:
# Modifying Item at 2nd Row and 3rd Column 
employee[2, 4] <- 100000
print(employee)

  Id    Name   Occupation Salary
1  1    John Professional  80000
2  2     Rob   Management 100000
3  3 Christy    Developer  75000
4  4 Johnson   Programmer  92000
5  5  Miller     Clerical  68000
6  6     Zhu        Admin  82000

In [38]:

#  Modifying All Item of 1st Column 
employee[, 1] <- c(10:15)
print(employee)

  Id    Name   Occupation Salary
1 10    John Professional  80000
2 11     Rob         <NA>  90000
3 12 Christy    Developer  75000
4 13 Johnson   Programmer  92000
5 14  Miller     Clerical  68000
6 15     Zhu        Admin  82000

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                   Add Elements to R Data Fram:
                </div>
    </font>
</div>

In [39]:
# Adding elements in R Data Frame

Id <- c(1:6)
Name <- c("John", "Rob", "Christy","Johnson", "Miller", "Zhu")
Salary <- c(80000, 90000, 75000, 92000, 68000, 82000)

employee <- data.frame(Id, Name, Salary, stringsAsFactors=FALSE)
print(employee)

# Adding Extra Row 
rbind(employee, list(7, "Gateway", 105505))

  Id    Name Salary
1  1    John  80000
2  2     Rob  90000
3  3 Christy  75000
4  4 Johnson  92000
5  5  Miller  68000
6  6     Zhu  82000

  Id Name    Salary
1 1  John     80000
2 2  Rob      90000
3 3  Christy  75000
4 4  Johnson  92000
5 5  Miller   68000
6 6  Zhu      82000
7 7  Gateway 105505

In [40]:
# Adding Extra Column 
Occupation <- c("Management", "Developer", "User", "Programmer", "Clerical", "Admin")
cbind(employee, Occupation)

  Id Name    Salary Occupation
1 1  John    80000  Management
2 2  Rob     90000  Developer
3 3  Christy 75000  User
4 4  Johnson 92000  Programmer
5 5  Miller  68000  Clerical
6 6  Zhu     82000  Admin

<div style="line-height:200%;">
    <font color=black face="Candara" size=4>
                <div align=left>
                   R Data Frame Special Functions:
                </div>
    </font>
</div>

In [42]:
Id <- c(1:10)
Name <- c("John", "Rob", "Ruben", "Christy","Johnson", "Miller", "Carlson", "Ruiz", "Yang","Zhu")
Occupation <- c("Professional", "Programmer","Management", "Clerical", 
                "Developer", "Programmer", "Management", "Clerical", "Developer","Programmer")
Salary <- c(80000, 70000, 90000, 50000, 60000, 75000, 92000, 68000, 55000, 82000)

employee <- data.frame(Id, Name, Occupation, Salary)
print(employee)

   Id    Name   Occupation Salary
1   1    John Professional  80000
2   2     Rob   Programmer  70000
3   3   Ruben   Management  90000
4   4 Christy     Clerical  50000
5   5 Johnson    Developer  60000
6   6  Miller   Programmer  75000
7   7 Carlson   Management  92000
8   8    Ruiz     Clerical  68000
9   9    Yang    Developer  55000
10 10     Zhu   Programmer  82000

In [43]:
typeof(employee)
class(employee)
names(employee)

# Number of Rows and Columns
length(employee)
ncol(employee)
nrow(employee)
dim(employee)

[1] "list"

[1] "data.frame"

[1] "Id"         "Name"       "Occupation" "Salary"

[1] 4

[1] 4

[1] 10

[1] 10  4